namespace ZsuTools.Entities
{
    public class Rank
    {
        public string RankName { get; }

        public Rank(string rankName)
        {
            RankName = rankName;
        }
        
        public enum RankType
        {
            None,
            Unknown,
            Unparsed,
            Генерал,
            ГенералЛейтенант,
            ГенералЛейтенантМС,
            ГенералМайор,
            ГенералМайорМС,
            БригаднийГенерал,
            БригаднийГенералМС,
            Полковник,
            ПолковникМС,
            ПолковникЮстиції,
            ПолковникКапеланськоїСлужби,
            Підполковник,
            ПідполковникМС,
            ПідполковникЮстиції,
            ПідполковникКапеланськоїСлужби,
            Майор,
            МайорМС,
            МайорЮстиції,
            МайорКапеланськоїСлужби,
            Капітан,
            КапітанМС,
            КапітанЮстиції,
            КапітанКапеланськоїСлужби,
            СтаршийЛейтенант,
            СтаршийЛейтенантМС,
            СтаршийЛейтенантЮстиції,
            СтаршийЛейтенантКапеланськоїСлужби,
            Лейтенант,
            ЛейтенантМС,
            ЛейтенантЮстиції,
            ЛейтенантКапеланськоїСлужби,
            МолодшийЛейтенант,
            МолодшийЛейтенантМС,
            МолодшийЛейтенантЮстиції,
            МолодшийЛейтенантКапеланськоїСлужби,
            ГоловнийМайстерСержант,
            СтаршийМайстерСержант,
            МайстерСержант,
            ШтабСержант,
            ГоловнийСержант,
            СтаршийСержант,
            Сержант,
            МолодшийСержант,
            СтаршийСолдат,
            Солдат,
            // Адмірал,
            // ВіцеАдмірал,
            // КонтрАдмірал,
            // Коммодор,
            // Капітан1Рангу,
            // Капітан2Рангу,
            // Капітан3Рангу,
            // КапітанЛейтенант,
            // СтаршийЛейтенант,
            // Лейтенант,
            // МолодшийЛейтенант,
            // ГоловнийМайстерСержант,
            // СтаршийМайстерСержант,
            // МайстерСержант,
            // ШтабСержант,
            // ГоловнийКорабельнийСержант,
            // ГоловнийСержант,
            // Старшина1Статті,
            // Старшина2Статті,
            // СтаршийМатрос,
            // Матрос,
            Рекрут
        }
    }
}